Ran Apply for project: `github` dir: `apps/github` workspace: `github`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false -no-color \\-\\a\\u\\t\\o\\-\\a\\p\\p\\r\\o\\v\\e" in "/atlantis-data/repos/mvaldes14/terraform/51/github/apps/github": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/mvaldes/github/runs/run-tSvA7P4vXDHu82xg

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
github_actions_secret.dockerhub_token["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_TOKEN]
github_actions_secret.telegram_to["twitch-bot"]: Refreshing state... [id=twitch-bot:TELEGRAM_TO]
github_actions_secret.telegram_chat["meal-notifier"]: Refreshing state... [id=meal-notifier:TELEGRAM_TOKEN]
github_actions_secret.telegram_to["meal-notifier"]: Refreshing state... [id=meal-notifier:TELEGRAM_TO]
github_actions_secret.dockerhub_username["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_USERNAME]
data.github_repository.blog: Refreshing...
github_actions_secret.dockerhub_username["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_USERNAME]
github_actions_secret.telegram_chat["twitch-bot"]: Refreshing state... [id=twitch-bot:TELEGRAM_TOKEN]
github_repository_webhook.wh["todoist.nvim"]: Refreshing state... [id=521309558]
github_actions_secret.dockerhub_token["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_TOKEN]
github_repository_webhook.wh["ansible_playbooks"]: Refreshing state... [id=521145032]
github_repository_webhook.wh["twitch-bot"]: Refreshing state... [id=521145035]
github_repository_webhook.wh["flakes"]: Refreshing state... [id=531262805]
github_repository_webhook.wh["pulumi"]: Refreshing state... [id=521145026]
github_repository_webhook.wh["dotfiles"]: Refreshing state... [id=521145038]
github_repository_webhook.wh["linear.nvim"]: Refreshing state... [id=521145043]
github_repository_webhook.wh["chef"]: Refreshing state... [id=521145056]
github_repository_webhook.wh["deckmaster-config"]: Refreshing state... [id=521145053]
github_repository_webhook.wh["meal-notifier"]: Refreshing state... [id=521145050]
github_repository_webhook.wh["k8s-apps"]: Refreshing state... [id=521145049]
github_repository_webhook.wh["dotfiles-nix"]: Refreshing state... [id=521145046]
github_repository.repo["flakes"]: Refreshing state... [id=flakes]
github_repository.repo["ansible_playbooks"]: Refreshing state... [id=ansible_playbooks]
github_repository.repo["meal-notifier"]: Refreshing state... [id=meal-notifier]
github_repository.repo["todoist.nvim"]: Refreshing state... [id=todoist.nvim]
github_repository.repo["deckmaster-config"]: Refreshing state... [id=deckmaster-config]
github_repository.repo["dotfiles-nix"]: Refreshing state... [id=dotfiles-nix]
data.github_repository.blog: Refresh complete after 2s [id=blog]
github_repository.repo["k8s-apps"]: Refreshing state... [id=k8s-apps]
github_repository.repo["twitch-bot"]: Refreshing state... [id=twitch-bot]
github_repository.repo["chef"]: Refreshing state... [id=chef]
github_repository.repo["linear.nvim"]: Refreshing state... [id=linear.nvim]
github_repository.repo["pulumi"]: Refreshing state... [id=pulumi]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_actions_secret.blog_docker_secret: Refreshing state... [id=blog:DOCKERHUB_USERNAME]
github_actions_secret.blog_docker_token: Refreshing state... [id=blog:DOCKERHUB_TOKEN]
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["pulumi"]: Drift detected (update)
github_repository.repo["ansible_playbooks"]: Drift detected (update)
github_repository.repo["twitch-bot"]: Drift detected (update)
github_repository.repo["linear.nvim"]: Drift detected (update)
github_repository.repo["meal-notifier"]: Drift detected (update)
github_repository.repo["chef"]: Drift detected (update)
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["flakes"]: Drift detected (update)
github_repository.repo["deckmaster-config"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["todoist.nvim"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.repo["scripts"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "MIT"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "scripts"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "homelab",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository_webhook.wh["scripts"] will be created
  + resource "github_repository_webhook" "wh" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "*",
        ]
      + id         = (known after apply)
      + repository = "scripts"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

github_repository_webhook.wh["scripts"]: Creating...
github_repository.repo["scripts"]: Creating...
github_repository.repo["scripts"]: Still creating... [10s elapsed]
github_repository.repo["scripts"]: Creation complete after 10s [id=scripts]
╷
│ Error: POST https://api.github.com/repos/mvaldes14/scripts/hooks: 404 Not Found []
│
│   with github_repository_webhook.wh["scripts"],
│   on main.tf line 51, in resource "github_repository_webhook" "wh":
│   51: resource "github_repository_webhook" "wh" {
│
╵
Operation failed: failed running terraform apply (exit 1)
```
</details>